In [1]:
import pandas as pd
import numpy as np

Pandas Data Structure

Series

Data Frame

# Series

Creating Series:

- Python List
- Python Range
- Numpy Range

In [2]:
series1= pd.Series([10,202,30,40])

Operations: (CRUD Operation= Create, Retrieve (Access) , Update, Delete)

- Create
- Access
- Update
- Delete

In [3]:
series1[3]=200

In [4]:
series1[3]

200

In [5]:
del series1[0]

In [6]:
list1= [1,2,4,4,5]

In [7]:
s2=pd.Series(range(5,20))
s2

0      5
1      6
2      7
3      8
4      9
5     10
6     11
7     12
8     13
9     14
10    15
11    16
12    17
13    18
14    19
dtype: int64

In [8]:
s3=pd.Series(np.arange(2,30))
s3

0      2
1      3
2      4
3      5
4      6
5      7
6      8
7      9
8     10
9     11
10    12
11    13
12    14
13    15
14    16
15    17
16    18
17    19
18    20
19    21
20    22
21    23
22    24
23    25
24    26
25    27
26    28
27    29
dtype: int32

In [9]:
myseries= pd.Series(["Mango","Orange","Banana","Melon","Apple"])
myseries
#series with default index

0     Mango
1    Orange
2    Banana
3     Melon
4     Apple
dtype: object

In [10]:
myseries= pd.Series(["Mango","Orange","Banana","Melon","Apple"], index=["M","O","B","M","A"])
myseries
#series with Label index, but also contains default index

M     Mango
O    Orange
B    Banana
M     Melon
A     Apple
dtype: object

In [11]:
myseries[1]

'Orange'

In [12]:
myseries.index

Index(['M', 'O', 'B', 'M', 'A'], dtype='object')

In [13]:
myseries.values

array(['Mango', 'Orange', 'Banana', 'Melon', 'Apple'], dtype=object)

In [14]:
myseries.value_counts

<bound method IndexOpsMixin.value_counts of M     Mango
O    Orange
B    Banana
M     Melon
A     Apple
dtype: object>

In [15]:
myseries.values[4]

'Apple'

In [16]:
yourseriesmyindex=pd.Series(range(0,5), index=myseries.index)
yourseriesmyindex

M    0
O    1
B    2
M    3
A    4
dtype: int64

In [17]:
ourseries=pd.Series(yourseriesmyindex.values, index=[00,11,22,33,44])
ourseries

0     0
11    1
22    2
33    3
44    4
dtype: int64

In [18]:
nextseries=pd.Series(ourseries, index=["A",11,"C",33,44])
nextseries

A     NaN
11    1.0
C     NaN
33    3.0
44    4.0
dtype: float64

In [19]:
xseries=ourseries + nextseries

In [20]:
ourseries.min()

0

In [21]:
ourseries.max()

4

In [22]:
ourseries.sort_values(ascending=False)

44    4
33    3
22    2
11    1
0     0
dtype: int64

In [23]:
%autosave 60

Autosaving every 60 seconds

# 18/1/2020

In [24]:
students={} #empty dictioanry

In [25]:
type(students)

dict

In [26]:
students["name"]=["Ali","Ahmed","Yasir","Kamran"]

In [27]:
students

{'name': ['Ali', 'Ahmed', 'Yasir', 'Kamran']}

# Data Frame

In [28]:
students={'Name':["Ali","Ahmed","Yasir","Kamran"], 
          'Roll No':[21,22,23,24],
          'Course':['Ai','Cloud','Network','Web'],
          'Age':[22,23,21,24]
         }

In [29]:
students

{'Name': ['Ali', 'Ahmed', 'Yasir', 'Kamran'],
 'Roll No': [21, 22, 23, 24],
 'Course': ['Ai', 'Cloud', 'Network', 'Web'],
 'Age': [22, 23, 21, 24]}

In [30]:
students = pd.DataFrame(students, index=['one','two','three','four'])

In [31]:
students

         Name  Roll No   Course  Age
one       Ali       21       Ai   22
two     Ahmed       22    Cloud   23
three   Yasir       23  Network   21
four   Kamran       24      Web   24

In [32]:
students.columns

Index(['Name', 'Roll No', 'Course', 'Age'], dtype='object')

In [33]:
students.index

Index(['one', 'two', 'three', 'four'], dtype='object')

In [34]:
students['Name']

one         Ali
two       Ahmed
three     Yasir
four     Kamran
Name: Name, dtype: object

In [35]:
students.Name

one         Ali
two       Ahmed
three     Yasir
four     Kamran
Name: Name, dtype: object

In [36]:
students1=pd.DataFrame(students,
                       columns=['Roll No',"Name",'Age','Course'], 
                       index=['one','two','three','four'])
students1

       Roll No    Name  Age   Course
one         21     Ali   22       Ai
two         22   Ahmed   23    Cloud
three       23   Yasir   21  Network
four        24  Kamran   24      Web

In [37]:
students1.index

Index(['one', 'two', 'three', 'four'], dtype='object')

In [38]:
students1["City"]=["Khi","Lhr","Isb","Qta"]
students1

       Roll No    Name  Age   Course City
one         21     Ali   22       Ai  Khi
two         22   Ahmed   23    Cloud  Lhr
three       23   Yasir   21  Network  Isb
four        24  Kamran   24      Web  Qta

In [39]:
students1["Status"]="Pass"

In [40]:
students1

       Roll No    Name  Age   Course City Status
one         21     Ali   22       Ai  Khi   Pass
two         22   Ahmed   23    Cloud  Lhr   Pass
three       23   Yasir   21  Network  Isb   Pass
four        24  Kamran   24      Web  Qta   Pass

In [41]:
students1["Age"]=students1["Age"]+5

In [42]:
students1

       Roll No    Name  Age   Course City Status
one         21     Ali   27       Ai  Khi   Pass
two         22   Ahmed   28    Cloud  Lhr   Pass
three       23   Yasir   26  Network  Isb   Pass
four        24  Kamran   29      Web  Qta   Pass

In [43]:
students1_rollno_city=students1[["Roll No", "City"]]
students1_rollno_city

       Roll No City
one         21  Khi
two         22  Lhr
three       23  Isb
four        24  Qta

In [44]:
students1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, one to four
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Roll No  4 non-null      int64
 1   Name     4 non-null      object
 2   Age      4 non-null      int64
 3   Course   4 non-null      object
 4   City     4 non-null      object
 5   Status   4 non-null      object
dtypes: int64(2), object(4)
memory usage: 224.0+ bytes

In [45]:
students1.describe()

         Roll No        Age
count   4.000000   4.000000
mean   22.500000  27.500000
std     1.290994   1.290994
min    21.000000  26.000000
25%    21.750000  26.750000
50%    22.500000  27.500000
75%    23.250000  28.250000
max    24.000000  29.000000

In [46]:
students1.iloc[2]

Roll No         23
Name         Yasir
Age             26
Course     Network
City           Isb
Status        Pass
Name: three, dtype: object

In [47]:
students1.loc["two"]

Roll No       22
Name       Ahmed
Age           28
Course     Cloud
City         Lhr
Status      Pass
Name: two, dtype: object

In [48]:
students1.loc[["two", 'one']]

     Roll No   Name  Age Course City Status
two       22  Ahmed   28  Cloud  Lhr   Pass
one       21    Ali   27     Ai  Khi   Pass

In [49]:
students1["Roll No"]

one      21
two      22
three    23
four     24
Name: Roll No, dtype: int64

In [50]:
students1.iloc[1:3,0:2]

       Roll No   Name
two         22  Ahmed
three       23  Yasir

In [51]:
#dfd.iloc[[0, 2], dfd.columns.get_loc('A')]

students1.iloc[1:3, students1.columns.get_loc("Roll No")]

two      22
three    23
Name: Roll No, dtype: int64

In [52]:
students1.loc[['one'],["Roll No","Name"]]

     Roll No Name
one       21  Ali

In [53]:
import numpy as np
import pandas as pd

In [54]:
obj=pd.Series([1.1,2.3,3.2,4.4], index=['d','b','a','c'])
obj

d    1.1
b    2.3
a    3.2
c    4.4
dtype: float64

In [55]:
obj2=pd.Series(np.arange(0,6),index=['a','b','c','d','e','f'])
obj2

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int32

In [56]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
    index=['Ohio', 'Colorado', 'Utah', 'New York'],
    columns=['one', 'two', 'three', 'four'])

In [57]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [58]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [59]:
data[["three",'two']]

          three  two
Ohio          2    1
Colorado      6    5
Utah         10    9
New York     14   13

In [60]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [61]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [62]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [63]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [64]:
 data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [65]:
data.iloc[:, :4][data.four > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [66]:
[data['three'] > 5]

[Ohio        False
 Colorado     True
 Utah         True
 New York     True
 Name: three, dtype: bool]

In [67]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [68]:
data.loc[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [69]:
data.loc[:'Utah', ['two']]

          two
Ohio        1
Colorado    5
Utah        9

In [70]:
(lambda y:y*y) (5)

25

In [71]:
biodata=pd.DataFrame({
                      'ID':[1,2,3,4,5],
                      'Name':['Asad','Riaz','Faraz','Fida','Tahir'],
                      'Age': [22,25,21,18,27],
                      'Salary':[20000,15000,40000,32000,41000]
})
biodata

   ID   Name  Age  Salary
0   1   Asad   22   20000
1   2   Riaz   25   15000
2   3  Faraz   21   40000
3   4   Fida   18   32000
4   5  Tahir   27   41000

In [72]:
biodata['Age']=biodata.apply(lambda x:x['Age']+2,axis=1)
biodata

   ID   Name  Age  Salary
0   1   Asad   24   20000
1   2   Riaz   27   15000
2   3  Faraz   23   40000
3   4   Fida   20   32000
4   5  Tahir   29   41000

In [73]:
biodata['Age']=biodata['Age'].apply(lambda x:x+1)
biodata

   ID   Name  Age  Salary
0   1   Asad   25   20000
1   2   Riaz   28   15000
2   3  Faraz   24   40000
3   4   Fida   21   32000
4   5  Tahir   30   41000

In [74]:
list(filter(lambda x: x>25000, biodata['Salary'] ))

[40000, 32000, 41000]

In [75]:
biodata['Salary'] = list(map(lambda x: int(x+x*0.2), biodata['Salary']))
biodata

   ID   Name  Age  Salary
0   1   Asad   25   24000
1   2   Riaz   28   18000
2   3  Faraz   24   48000
3   4   Fida   21   38400
4   5  Tahir   30   49200

In [76]:
biodata['category']=['Adult' if age >=25 else 'child' for age in biodata['Age']]
biodata

   ID   Name  Age  Salary category
0   1   Asad   25   24000    Adult
1   2   Riaz   28   18000    Adult
2   3  Faraz   24   48000    child
3   4   Fida   21   38400    child
4   5  Tahir   30   49200    Adult

In [77]:
result={'Student':['Ali','Ahmed','Taha','Furqan','Rizwan'],
        'English':[56,67,75,49,66],
        'Maths':  [77,47,78,90,82],
        'Science':[59,64,91,87,88]}

In [78]:
result_df=pd.DataFrame(result, index=[np.arange(1,6)])
result_df

  Student  English  Maths  Science
1     Ali       56     77       59
2   Ahmed       67     47       64
3    Taha       75     78       91
4  Furqan       49     90       87
5  Rizwan       66     82       88

In [79]:
#biodata['Age']=biodata.apply(lambda x:x['Age']+2,axis=1)
result_df['Total']=result_df.apply(lambda x:x['Maths']+x['English']+x['Science'], axis=1)
result_df

  Student  English  Maths  Science  Total
1     Ali       56     77       59    192
2   Ahmed       67     47       64    178
3    Taha       75     78       91    244
4  Furqan       49     90       87    226
5  Rizwan       66     82       88    236

In [80]:
result_df['Percentage']=result_df.apply(lambda x:round((x['Total']/300)*100, 2), axis=1)
result_df

  Student  English  Maths  Science  Total  Percentage
1     Ali       56     77       59    192       64.00
2   Ahmed       67     47       64    178       59.33
3    Taha       75     78       91    244       81.33
4  Furqan       49     90       87    226       75.33
5  Rizwan       66     82       88    236       78.67

TypeError: round() missing required argument 'number' (pos 1)